[
  {
    "id": 1442440,
    "title": "Con Mum",
    "release_date": "2025-03-24",
    "overview": "A chef's life is upended when a jet-setting, champagne-sipping, hotel-hopping woman claims to be his long-lost mother. This documentary reveals the untold story.",
    "vote_average": 7.538,
    "poster_path": "/iA5ZHflyzsxmR09Ce53w9Ng0tIx.jpg",
    "genre_ids": [
      99,
      80
    ],
    "saved_at": "2025-05-24T18:11:23+0200"
  },
  {
    "id": 558449,
    "title": "Gladiator II",
    "release_date": "2024-11-13",
    "overview": "Years after witnessing the death of the revered hero Maximus at the hands of his uncle, Lucius is forced to enter the Colosseum after his home is conquered by the tyrannical Emperors who now lead Rome with an iron fist. With rage in his heart and the future of the Empire at stake, Lucius must look to his past to find strength and honor to return the glory of Rome to its people.",
    "vote_average": 6.756,
    "poster_path": "/2cxhvwyEwRlysAmRH4iodkvo0z5.jpg",
    "genre_ids": [
      28,
      12,
      18
    ],
    "saved_at": "2025-05-24T18:11:23+0200"
  },
  {
    "id": 1426486,
    "title": "Chaos: The Manson Murders",
    "release_date": "2025-03-06",
    "overview": "In August 1969, Charles Manson's followers killed seven people on his orders. Why? Explore a conspiracy of mind control, CIA experiments, and murder.",
    "vote_average": 6.2,
    "poster_path": "/lcWOKxTVZybE8aRUhzkKokU2s0s.jpg",
    "genre_ids": [
      99,
      80
    ],
    "saved_at": "2025-05-24T18:11:23+0200"
  },
  {
    "id": 438478,
    "title": "Pornocracy: The New Sex Multinationals",
    "release_date": "2017-03-12",
    "overview": "Never before have we watched as much porn as today yet the traditional porn industry is dying. The arrival of web sites showing amateur clips has transformed the way porn is made and consumed. Behind this transformation lies one opaque multinational.",
    "vote_average": 6.71,
    "poster_path": "/kfa1KHSaewjv9sSrrHDdWNdroyv.jpg",
    "genre_ids": [
      99
    ],
    "saved_at": "2025-05-24T18:11:23+0200"
  },
  {
    "id": 774370,
    "title": "Dog Man",
    "release_date": "2025-01-24",
    "overview": "When a faithful police dog and his human police officer owner are injured together on the job, a harebrained but life-saving surgery fuses the two of them together and Dog Man is born. Dog Man is sworn to protect and serve—and fetch, sit and roll over. As Dog Man embraces his new identity and strives to impress his Chief, he must stop the pretty evil plots of feline supervillain Petey the Cat.",
    "vote_average": 7.8,
    "poster_path": "/89wNiexZdvLQ41OQWIsQy4O6jAQ.jpg",
    "genre_ids": [
      10751,
      35,
      12,
      16
    ],
    "saved_at": "2025-05-24T18:11:23+0200"
  },
  {
    "id": 1012290,
    "title": "South Park: The 25th Anniversary Concert",
    "release_date": "2022-08-14",
    "overview": "Trey Parker and Matt Stone celebrate South Park's 25th anniversary with a concert in Colorado, featuring Primus and Ween.",
    "vote_average": 8.219,
    "poster_path": "/awZ6LARNXh1hmZyn9XY6WMlkaR4.jpg",
    "genre_ids": [
      10402,
      35,
      99
    ],
    "saved_at": "2025-05-24T18:11:23+0200"
  },
  {
    "id": 1232493,
    "title": "No Other Land",
    "release_date": "2024-11-01",
    "overview": "This film made by a Palestinian-Israeli collective shows the destruction of the occupied West Bank's Masafer Yatta by Israeli soldiers and the alliance which develops between the Palestinian activist Basel and Israeli journalist Yuval.",
    "vote_average": 7.983,
    "poster_path": "/s7XYieuZg9kMe07i9VI4bfGN4Pw.jpg",
    "genre_ids": [
      99
    ],
    "saved_at": "2025-05-24T18:18:30+0200"
  }
]